In [1]:
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [2]:
for i in high_schools:
    print(i)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [18]:
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [19]:
for i in high_school_types:
    print(i)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [5]:
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [6]:
import pandas as pd

In [8]:
school_series = pd.Series(high_schools)

In [9]:
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [22]:
school_df = pd.DataFrame(high_school_dicts)

In [23]:
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [24]:
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [25]:
school_df = pd.DataFrame()

In [29]:
school_df['School ID']= school_id
school_df['School Nmae']= school_name
school_df['School Type']= type_of_school

In [30]:
school_df

   School ID            School Nmae School Type
0          0      Huang High School    District
1          1   Figueroa High School    District
2          2    Shelton High School     Charter
3          3  Hernandez High School    District
4          4    Griffin High School     Charter

In [36]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [38]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [39]:
school_df.values

array([[0, 'Huang High    School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [44]:
import os
school_to_load = os.path.join("Resource", "schools_complete.csv")
student_to_load = os.path.join("Resource", "students_complete.csv")

In [47]:
school_df = pd.read_csv(school_to_load)
student_df = pd.read_csv(student_to_load)
school_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [49]:
student_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [50]:
school_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [51]:
student_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [53]:
school_df.isnull().sum()

School ID      0
school_name    0
type           0
size           0
budget         0
dtype: int64

In [54]:
student_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [56]:
school_df.notnull().sum()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [57]:
student_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [61]:
import os

file_to_load = os.path.join("Resource", "missing_grades.csv")

missing_grades_df = pd.read_csv(file_to_load)
missing_grades_df

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0        61.0
2           2    Kevin Rodriguez      M  12th            NaN        60.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0
5           5      Bryan Miranda      M   9th           94.0         NaN
6           6      Sheena Carter      F  11th           82.0        80.0
7           7       Nicole Baker      F  12th           96.0        69.0

In [62]:
missing_grades_df.fillna(85)

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0        61.0
2           2    Kevin Rodriguez      M  12th           85.0        60.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0
5           5      Bryan Miranda      M   9th           94.0        85.0
6           6      Sheena Carter      F  11th           82.0        80.0
7           7       Nicole Baker      F  12th           96.0        69.0

In [64]:
student_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [66]:
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

for word in prefixes_suffixes:
    student_df["student_name"] = student_df["student_name"].str.replace(word, "")

In [69]:
student_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [71]:
student_df.to_csv(r'Resource/schools_complete.csv\clean_students_complete_csv')

In [76]:
student_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [75]:
school_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [89]:
school_complete_df = pd.merge(left = school_df, right =student_df, on = ["school_name","school_name"])

In [91]:
school_complete_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [93]:
school_count =len(school_complete_df["school_name"].unique)
school_count

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [98]:
len(school_count)

39170

In [157]:
budget_group = school_complete_df.groupby(['school_name'])
total_budget = budget_group.mean()["budget"].sum()
total_budget

24649428.0

In [158]:
passing_reading_df =school_complete_df.loc[school_complete_df["reading_score"] >=70]
passing_math_df = school_complete_df.loc[school_complete_df["math_score"]>=70]
passing_math_count = passing_math_df["student_name"].count()
passing_reading_count = passing_reading_df["student_name"].count()
print(passing_math_count)
print(passing_reading_count)

29370
33610

In [159]:
student_count = school_complete_df["Student ID"].count()
student_count

39170

In [188]:
def get_percentge(a,b):
    return(a/float(b)*100)
percentage_passing_math = get_percentge(passing_math_count,student_count)
percentage_passing_reading = get_percentge(passing_reading_count, student_count)
average_math_score = school_complete_df["math_score"].mean()
average_reading_score = school_complete_df["reading_score"].mean()

print(percentage_passing_math)
print(percentage_passing_reading)

74.9808526933878
85.80546336482001

In [189]:
passing_both_math_reading_df = school_complete_df.loc[(school_complete_df["reading_score"] >= 70) & (school_complete_df["math_score"] >=70)]

In [190]:
passing_both_math_reading_count = passing_both_math_reading_df["student_name"].count()
print(passing_both_math_reading_count)

25528

In [191]:
percentage_passing_both_math_reading = get_percentge(passing_both_math_reading_count,student_count)
print(percentage_passing_both_math_reading)

65.17232575950983

In [192]:
district_summary_df = pd.DataFrame([{
    "Total School": len(school_count),
    "Total Student": student_count,
    "Total Budget": total_budget,
    "Average Math Score": average_math_score,
    "Average Reading Score": average_reading_score,
    "% Passing Math": percentage_passing_math,
    "% Passing Reading": percentage_passing_reading,
    "% Passing Overall": percentage_passing_both_math_reading
}])
district_summary_df

,Total School,Total Student,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Passing Overall
0,15,39170,24649428.0,78.985371,81.87784,74.980853,85.805463,65.172326

In [239]:
district_summary_df

,Total School,Total Student,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Passing Overall
0,15,39170,"$24,649,428.00",78.985371,81.9,75,86,65

In [242]:

district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

In [243]:
district_summary_df

,Total School,Total Student,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Passing Overall
0,15,39170,"$24,649,428.00",79.0,81.9,75,86,65

In [345]:
per_school_types = school_df.set_index(["school_name"])["type"]
per_school_types

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [346]:
# convert series into dataframe

df = pd.DataFrame(pre_school_types)

In [347]:
per_school_count = school_df.set_index(["school_name"])["size"]
per_school_budget = school_df.set_index(["school_name"])["budget"]
per_school_per_capital = pre_school_budget / pre_school_count
per_school_per_capital

school_name
Huang High School        655.0
Figueroa High School     639.0
Shelton High School      600.0
Hernandez High School    652.0
Griffin High School      625.0
Wilson High School       578.0
Cabrera High School      582.0
Bailey High School       628.0
Holden High School       581.0
Pena High School         609.0
Wright High School       583.0
Rodriguez High School    637.0
Johnson High School      650.0
Ford High School         644.0
Thomas High School       638.0
dtype: float64

In [348]:
per_school_math_average =school_complete_df.groupby(["school_name"])["math_score"].mean()
per_school_reading_average =school_complete_df.groupby(["school_name"])["math_score"].mean()
print(per_school_math_average)
print(per_school_reading_average)

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64
school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [349]:
per_school_passing_math = school_complete_df[school_complete_df["math_score"] >= 70]
per_school_passing_reading = school_complete_df[school_complete_df["reading_score"]>= 70]
per_passing_math_reading = school_complete_df[(school_complete_df["math_score"] >=70) &(school_complete_df["reading_score"]>=70)]



per_school_average_passing_reading = per_school_passing_math.groupby(['school_name'])["reading_score"].mean()
per_school_average_passing_math = per_school_passing_reading.groupby(['school_name'])["math_score"].mean()




per_school_count_passing_reading = per_school_passing_reading.groupby(["school_name"]).count()["student_name"]

per_school_count_passing_math = per_school_passing_math.groupby(['school_name']).count()["student_name"]
per_passing_math_reading = per_passing_math_reading.groupby(["school_name"]).count()["student_name"]

In [358]:
per_school_passing_math_percentage = per_school_count_passing_math / pre_school_count * 100

per_school_passing_reading_percentage = per_school_count_passing_reading / pre_school_count * 100
per_school_passing_reading_percentage

school_name
Bailey High School       81.933280
Cabrera High School      97.039828
Figueroa High School     80.739234
Ford High School         79.299014
Griffin High School      97.138965
Hernandez High School    80.862999
Holden High School       96.252927
Huang High School        81.316421
Johnson High School      81.222432
Pena High School         95.945946
Rodriguez High School    80.220055
Shelton High School      95.854628
Thomas High School       97.308869
Wilson High School       96.539641
Wright High School       96.611111
dtype: float64

In [350]:
per_overall_passing_percentage = per_passing_math_reading / pre_school_count * 100
per_overall_passing_percentage

school_name
Bailey High School       54.642283
Cabrera High School      91.334769
Figueroa High School     53.204476
Ford High School         54.289887
Griffin High School      90.599455
Hernandez High School    53.527508
Holden High School       89.227166
Huang High School        53.513884
Johnson High School      53.539172
Pena High School         90.540541
Rodriguez High School    52.988247
Shelton High School      89.892107
Thomas High School       90.948012
Wilson High School       90.582567
Wright High School       90.333333
dtype: float64

In [359]:
per_school_summary_df = pd.DataFrame({
   "School Type": per_school_types,
    "Total Students": per_school_count,
    "Total School Budget": per_school_budget,
    "Per Student Budget": per_school_per_capital,
    "Average Math Score": per_school_average_passing_math,
    "Average Reading Score": per_school_average_passing_reading,
    "% Passing Math": per_school_passing_math_percentage,
    "% Passing Reading": per_school_passing_reading_percentage,
    "% Overall Passing": per_overall_passing_percentage})

In [363]:
per_school_summary_df.columns

Index(['School Type', 'Total Students', 'Total School Budget',
       'Per Student Budget', 'Average Math Score', 'Average Reading Score',
       '% Passing Math', '% Passing Reading', '% Overall Passing'],
      dtype='object')

In [364]:
per_school_summary_df["Average Math Score"] = per_school_summary_df["Average Math Score"].map("{:.1f}".format)

per_school_summary_df["Average Reading Score"] = per_school_summary_df["Average Reading Score"].map("{:.1f}".format)

per_school_summary_df["% Passing Math"] = per_school_summary_df["% Passing Math"].map("{:.0f}".format)

per_school_summary_df["% Passing Reading"] = per_school_summary_df["% Passing Reading"].map("{:.0f}".format)

per_school_summary_df["% Overall Passing"] = per_school_summary_df["% Overall Passing"].map("{:.0f}".format)
per_school_summary_df["Total School Budget"] = per_school_summary_df["Total School Budget"].map("${:,.2f}".format)
per_school_summary_df["Per Student Budget"] = per_school_summary_df["Per Student Budget"].map("${:,.2f}".format)

In [366]:
per_school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.0,81.0,67,82,55
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.1,84.0,94,97,91
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.5,81.2,66,81,53
Ford High School,District,2739,"$1,763,916.00",$644.00,77.2,80.9,68,79,54
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.4,83.8,93,97,91

In [368]:
top_school = per_school_summary_df.sort_values(["% Overall Passing"], ascending = False)
top_school.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.1,84.0,94,97,91
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.4,83.8,93,97,91
Pena High School,Charter,962,"$585,858.00",$609.00,83.8,84.1,95,96,91
Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.5,83.9,93,97,91
Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.3,84.0,94,97,91

In [369]:
bottom_school = per_school_summary_df.sort_values(["% Overall Passing"], ascending = True)
bottom_school.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.5,81.2,66,81,53
Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.8,80.6,66,80,53
Ford High School,District,2739,"$1,763,916.00",$644.00,77.2,80.9,68,79,54
Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.2,80.9,67,81,54
Huang High School,District,2917,"$1,910,635.00",$655.00,76.7,81.2,66,81,54

In [376]:
student_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [394]:
student_9th_average_math = student_df[student_df["grade"]=="9th"].groupby(["school_name"]).mean()['math_score']
student_10th_average_math = student_df[student_df["grade"]=="10th"].groupby(["school_name"]).mean()['math_score']
student_11th_average_math = student_df[student_df["grade"]=="11th"].groupby(["school_name"]).mean()['math_score']
student_12th_average_math = student_df[student_df["grade"]=="12th"].groupby(["school_name"]).mean()['math_score']

In [395]:
student_9th_average_reading = student_df[student_df["grade"]=="9th"].groupby(["school_name"]).mean()['reading_score']
student_10th_average_reading = student_df[student_df["grade"]=="10th"].groupby(["school_name"]).mean()['reading_score']
student_11th_average_reading = student_df[student_df["grade"]=="11th"].groupby(["school_name"]).mean()['reading_score']
student_12th_average_reading = student_df[student_df["grade"]=="12th"].groupby(["school_name"]).mean()['reading_score']

In [397]:
math_scores_by_grade = pd.DataFrame({
    "9th": student_9th_average_math,
    "10th": student_10th_average_math,
    "11th": student_11th_average_math,
    "12th": student_12th_average_math
})

In [398]:
reading_score_by_grade = pd.DataFrame({
    "9th": student_9th_average_reading,
    "10th": student_10th_average_reading,
    "11th": student_11th_average_reading,
    "12th": student_12th_average_reading
})

In [403]:
  math_scores_by_grade["9th"] = math_scores_by_grade["9th"].map("{:.1f}".format)

  math_scores_by_grade["10th"] = math_scores_by_grade["10th"].map("{:.1f}".format)

  math_scores_by_grade["11th"] = math_scores_by_grade["11th"].map("{:.1f}".format)

  math_scores_by_grade["12th"] = math_scores_by_grade["12th"].map("{:.1f}".format)

ValueError: Unknown format code 'f' for object of type 'str'

In [405]:
  reading_score_by_grade["9th"] = reading_score_by_grade["9th"].map("{:.1f}".format)

  reading_score_by_grade["10th"] = reading_score_by_grade["10th"].map("{:.1f}".format)

  reading_score_by_grade["11th"] = reading_score_by_grade["11th"].map("{:.1f}".format)

  reading_score_by_grade["12th"] = reading_score_by_grade["12th"].map("{:.1f}".format)

In [407]:
reading_score_by_grade.head()

                       9th  10th  11th  12th
school_name
Bailey High School    81.3  80.9  80.9  80.9
Cabrera High School   83.7  84.3  83.8  84.3
Figueroa High School  81.2  81.4  80.6  81.4
Ford High School      80.6  81.3  80.4  80.7
Griffin High School   83.4  83.7  84.3  84.0

In [408]:
math_scores_by_grade.head()

                       9th  10th  11th  12th
school_name
Bailey High School    77.1  77.0  77.5  76.5
Cabrera High School   83.1  83.2  82.8  83.3
Figueroa High School  76.4  76.5  76.9  77.2
Ford High School      77.4  77.7  76.9  76.2
Griffin High School   82.0  84.2  83.8  83.4

In [415]:
per_school_per_capital

school_name
Huang High School        655.0
Figueroa High School     639.0
Shelton High School      600.0
Hernandez High School    652.0
Griffin High School      625.0
Wilson High School       578.0
Cabrera High School      582.0
Bailey High School       628.0
Holden High School       581.0
Pena High School         609.0
Wright High School       583.0
Rodriguez High School    637.0
Johnson High School      650.0
Ford High School         644.0
Thomas High School       638.0
dtype: float64

In [416]:
spending_bins = [0, 585, 630, 645, 675]
pd.cut(per_school_per_capital, spending_bins)

school_name
Huang High School        (645, 675]
Figueroa High School     (630, 645]
Shelton High School      (585, 630]
Hernandez High School    (645, 675]
Griffin High School      (585, 630]
Wilson High School         (0, 585]
Cabrera High School        (0, 585]
Bailey High School       (585, 630]
Holden High School         (0, 585]
Pena High School         (585, 630]
Wright High School         (0, 585]
Rodriguez High School    (630, 645]
Johnson High School      (645, 675]
Ford High School         (630, 645]
Thomas High School       (630, 645]
dtype: category
Categories (4, interval[int64]): [(0, 585] < (585, 630] < (630, 645] < (645, 675]]

In [453]:
group_names = ["<$584", "$585-629", "$630-644", "$645-675"]
per_school_summary_df["Spending Ranges (Per Student)"] = pd.cut(per_school_per_capital, spending_bins, labels = group_names)

In [480]:
per_school_summary_df["Average Math Score"] = per_school_summary_df["Average Math Score"].astype(float)
per_school_summary_df["Average Reading Score"] = per_school_summary_df["Average Reading Score"].astype(float)
per_school_summary_df["% Passing Math"]= per_school_summary_df["% Passing Math"].astype(float)
per_school_summary_df["% Passing Reading"]= per_school_summary_df["% Passing Reading"].astype(float)
per_school_summary_df["% Overall Passing"]= per_school_summary_df["% Overall Passing"].astype(float)

In [484]:
spending_math_scores = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["Average Math Score"]
spending_reading_scores = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["Average Reading Score"]

spending_passing_math = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["% Passing Math"]

spending_passing_reading = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["% Passing Reading"]

overall_passing_spending = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["% Overall Passing"]

In [485]:
overall_passing_spending

Spending Ranges (Per Student)
<$584       90.25
$585-629    81.75
$630-644    62.75
$645-675    54.00
Name: % Overall Passing, dtype: float64

In [486]:
spending_summary_df = pd.DataFrame({
          "Average Math Score" : spending_math_scores,
          "Average Reading Score": spending_reading_scores,
          "% Passing Math": spending_passing_math,
          "% Passing Reading": spending_passing_reading,
          "% Overall Passing": overall_passing_spending})

spending_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Spending Ranges (Per Student),,,,,
<$584,83.475000,83.975,93.500000,96.75,90.25
$585-629,81.900000,83.125,87.250000,92.75,81.75
$630-644,78.500000,81.650,73.250000,84.25,62.75
$645-675,76.966667,81.000,66.333333,81.00,54.00

In [487]:
spending_summary_df["Average Math Score"] = spending_summary_df["Average Math Score"].map("{:.1f}".format)

spending_summary_df["Average Reading Score"] = spending_summary_df["Average Reading Score"].map("{:.1f}".format)

spending_summary_df["% Passing Math"] = spending_summary_df["% Passing Math"].map("{:.0f}".format)

spending_summary_df["% Passing Reading"] = spending_summary_df["% Passing Reading"].map("{:.0f}".format)

spending_summary_df["% Overall Passing"] = spending_summary_df["% Overall Passing"].map("{:.0f}".format)

spending_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Spending Ranges (Per Student),,,,,
<$584,83.5,84.0,94,97,90
$585-629,81.9,83.1,87,93,82
$630-644,78.5,81.7,73,84,63
$645-675,77.0,81.0,66,81,54

In [5]:
per_school_summary_df

NameError: name 'per_school_summary_df' is not defined

In [490]:
per_school_summary_df["Total Students"]
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]
per_school_summary_df["school size"]= pd.cut(per_school_summary_df["Total Students"], size_bins, labels = group_names)

In [499]:
size_math_scores = per_school_summary_df.groupby(['school size']).mean()["Average Math Score"]
size_reading_scores = per_school_summary_df.groupby(['school size']).mean()["Average Reading Score"]
size_passing_math = per_school_summary_df.groupby(['school size']).mean()["% Passing Math"]
size_passing_reading = per_school_summary_df.groupby(['school size']).mean()["% Passing Reading"]
size_overall_passing = per_school_summary_df.groupby(['school size']).mean()["% Overall Passing"]

In [500]:
size_summary_df = pd.DataFrame({
          "Average Math Score" : size_math_scores,
          "Average Reading Score": size_reading_scores,
          "% Passing Math": size_passing_math,
          "% Passing Reading": size_passing_reading,
          "% Overall Passing": size_overall_passing})

size_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
school size,,,,,
Small (<1000),83.8000,84.0000,94.0,96.00,90.0
Medium (1000-2000),83.4200,83.8600,93.4,96.80,90.6
Large (2000-5000),77.7125,81.3375,70.0,82.75,58.5

In [501]:
size_summary_df["Average Math Score"] = size_summary_df["Average Math Score"].map("{:.1f}".format)

size_summary_df["Average Reading Score"] = size_summary_df["Average Reading Score"].map("{:.1f}".format)

size_summary_df["% Passing Math"] = size_summary_df["% Passing Math"].map("{:.0f}".format)

size_summary_df["% Passing Reading"] = size_summary_df["% Passing Reading"].map("{:.0f}".format)

size_summary_df["% Overall Passing"] = size_summary_df["% Overall Passing"].map("{:.0f}".format)

size_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
school size,,,,,
Small (<1000),83.8,84.0,94,96,90
Medium (1000-2000),83.4,83.9,93,97,91
Large (2000-5000),77.7,81.3,70,83,58

In [504]:
per_school_summary_df["School Type"].unique()

array(['District', 'Charter'], dtype=object)

In [507]:
type_math_scores = per_school_summary_df.groupby(["School Type"]).mean()["Average Math Score"]

type_reading_scores = per_school_summary_df.groupby(["School Type"]).mean()["Average Reading Score"]

type_passing_math = per_school_summary_df.groupby(["School Type"]).mean()["% Passing Math"]

type_passing_reading = per_school_summary_df.groupby(["School Type"]).mean()["% Passing Reading"]

type_overall_passing = per_school_summary_df.groupby(["School Type"]).mean()["% Overall Passing"]

In [508]:
type_summary_df = pd.DataFrame({
          "Average Math Score" : type_math_scores,
          "Average Reading Score": type_reading_scores,
          "% Passing Math": type_passing_math,
          "% Passing Reading": type_passing_reading,
          "% Overall Passing": type_overall_passing})

type_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.500000,83.912500,93.625000,96.625000,90.500000
District,76.914286,80.957143,66.571429,80.714286,53.857143

In [509]:
type_summary_df["Average Math Score"] = type_summary_df["Average Math Score"].map("{:.1f}".format)

type_summary_df["Average Reading Score"] = type_summary_df["Average Reading Score"].map("{:.1f}".format)

type_summary_df["% Passing Math"] = type_summary_df["% Passing Math"].map("{:.0f}".format)

type_summary_df["% Passing Reading"] = type_summary_df["% Passing Reading"].map("{:.0f}".format)

type_summary_df["% Overall Passing"] = type_summary_df["% Overall Passing"].map("{:.0f}".format)

type_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.5,83.9,94,97,90
District,76.9,81.0,67,81,54